# 목차

<b>1. pands 개요</b>  
1.1 pandas 특징  
1.2 pandas 패키지 설치  
1.3 pandas 패키지 가져오기    

<b>2. 시리즈 클래스 (series class)  </b>  
2.1 시리즈 정의 및 특성  
2.2 시리즈 생성  
2.3 시리즈 확인  
2.4 시리즈의 인덱스  
2.5 시리즈 연산  
2.6 시리즈 인덱싱  
2.7 시리즈 슬라이싱(slicing)  
2.8 시리즈의 데이터 갱신, 추가, 삭제  
2.9 시리즈와 딕셔너리 자료형  

<b>3. 데이터프레임(DataFrame)</b>  
3.1 데이터프레임(DataFrame) 정의 및 특성  
3.2 데이터프레임 생성  
3.3 데이터프레임 열 갱신 추가  
3.4 데이터프레임 인덱싱  
3.5 데이터프레임 고급 인덱싱  
3.6 Boolean 인덱싱  

<b>4. 데이터프레임 다루기 </b>   
4.1 numpy randn 사용하여 데이터프레임 생성  
4.2 numpy로 데이터프레임 결측치 다루기  
4.3 drop 명령어  
4.4 merge 명령어  

<b>5. 데이터 입출력</b>  
5.1 pandas 데이터 파일 불러오기  
5.2 pandas 데이터 파일 쓰기  
5.3 인터넷에서 데이터 불러오기  

<b>6. 데이터 처리하기</b>     
6.1 정렬(Sort)  
6.2 apply 함수  
6.3 describe 메서드  

<b>7. pandas 시계열 분석  </b>
7.1 pd.to_datetime 함수  
7.2 pd.date_range 함수

## 1.2 pandas 패키지 설치

In [ ]:
#!pip install pandas

## 1.3 pandas 패키지 불러오기

In [1]:
import pandas as pd

# 2. 시리즈 클래스 (series class)

## 2.1 시리즈 생성

In [2]:
import numpy as np

# 1차원 배열 생성
arr = np.array([1,2,3,4])

arr

array([1, 2, 3, 4])

In [3]:
arr[0]

1

In [7]:
# index와 함께 다니는 것 확인
obj = pd.Series(arr) 
print(obj)

obj = pd.Series([4, 5, -2, 8]) 
print(obj)

0    1
1    2
2    3
3    4
dtype: int32
0    4
1    5
2   -2
3    8
dtype: int64

## 2.2 시리즈 확인

In [8]:
obj.values

array([ 4,  5, -2,  8], dtype=int64)

In [10]:
# index 번호가 0번부터 4 전까지 1칸씩
# 즉, 0, 1, 2, 3
obj.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
obj.dtypes

dtype('int64')

## 2.3 시리즈의 인덱스

In [12]:
obj1 = pd.Series([5, 8, -1, 9], index=["a", "b", "c", "d"]) 

obj1

a    5
b    8
c   -1
d    9
dtype: int64

## 2.4 시리즈 인덱싱

In [13]:
a = pd.Series([1024, 2048, 3096, 6192],
              index=["서울", "부산", "인천", "대구"])
a

서울    1024
부산    2048
인천    3096
대구    6192
dtype: int64

In [15]:
# 내부적으로 숫자(0, 1, 2, 3)를 번호로도 가지고 있어서 
# 아래와 같은 접근도 가능
a[1], a["부산"]

(2048, 2048)

In [16]:
a[3], a["대구"]

(6192, 6192)

In [17]:
a[["서울", "대구", "부산"]]

서울    1024
대구    6192
부산    2048
dtype: int64

In [18]:
a[[0, 3, 1]]

서울    1024
대구    6192
부산    2048
dtype: int64

## 2.5 시리즈 슬라이싱(slicing)

In [19]:
# index 3번을 제외하고, 1이랑 2번
a[1:3]

부산    2048
인천    3096
dtype: int64

In [20]:
# 이름으로 indexing하면 마지막 거를 포함함
a["부산":"대구"]

부산    2048
인천    3096
대구    6192
dtype: int64

## 2.6 시리즈의 데이터 갱신, 추가, 삭제

In [21]:
a["부산"] = 1234
a

서울    1024
부산    1234
인천    3096
대구    6192
dtype: int64

In [22]:
a[3] = 6543
a

서울    1024
부산    1234
인천    3096
대구    6543
dtype: int64

In [23]:
del a["서울"]
a

부산    1234
인천    3096
대구    6543
dtype: int64

## 2.7 시리즈와 딕셔너리 자료형

index랑 key 비슷한데?

In [24]:
data = {"Kim": 35000, 
        "Park": 67000, 
        "Joon": 12000, 
        "Choi": 4000}

In [25]:
# dictionary로 series 선언 가능
obj2 = pd.Series(data) 
obj2

Kim     35000
Park    67000
Joon    12000
Choi     4000
dtype: int64

In [26]:
obj2.name = "Salary" 
obj2.index.name = "Full Names" 

obj2

Full Names
Kim     35000
Park    67000
Joon    12000
Choi     4000
Name: Salary, dtype: int64

1. serise(행)의 이름을 쓸 수 있는 npArray<br>  
2. index를 숫자로도 쓸 수 있지만 이름을 지정할 수 있다. 
- 이름을 지정해도 여전히 내부적으로는 숫자를 보관하고 있어서 숫자로 접근이 가능하다. 
- 이름을 지정한 형태가 dictionary와 비슷한 걸 보니 그를 통해 선언이 가능하다. 
3. 표에 이름, 행의 이름 지정하듯이 이름을 정해 줄 수 있다.

# 3. 데이터프레임(DataFrame)

## 3.2 데이터프레임 생성

In [28]:
a = np.arange(12)
a

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11])

In [29]:
a.shape

(12,)

In [31]:
a.reshape(3,4)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [33]:
df0 = pd.DataFrame(a.reshape(3,4))
df0

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [34]:
import pandas as pd
d1 = {
'a': ["a0", "b0", "c0"], 
'b': ["a1", "b1", "c1"], 
'c': ["a2", "b2", "c2"]
} 
df1 = pd.DataFrame(d1) 
df1

    a   b   c
0  a0  a1  a2
1  b0  b1  b2
2  c0  c1  c2

In [38]:
d2 = {
'b': ["b2", "b3", "b4"], 
'c': ["c2", "c3", "c4"], 
'd': ["d2", "d3", "d4"]
} 
# index도 보기 편하게 재정의 가능
df2 = pd.DataFrame(d2, index=([1,2,3])) 
df2

    b   c   d
1  b2  c2  d2
2  b3  c3  d3
3  b4  c4  d4

In [42]:
# DataFrame을 붙이기 : concat
# axis = 0(행), 1(열)을 기준으로 붙이겠다
# join = 'inner' : 공통된 부분을 기준으로 붙임 (ex. 나라 이름을 기준으로 GDP, 행복지수 표를 붙임)

print(pd.concat([df1,df2], axis=0, join='inner'))
print("\n")
print(pd.concat([df1,df2], axis=1, join='inner'))

    b   c
0  a1  a2
1  b1  b2
2  c1  c2
1  b2  c2
2  b3  c3
3  b4  c4


    a   b   c   b   c   d
1  b0  b1  b2  b2  c2  d2
2  c0  c1  c2  b3  c3  d3

In [43]:
data = {
    'name'  : ["Choi", "Choi", "Choi", "Kim", "Park"], 
    'year'  : [2013, 2014, 2015, 2016, 2017], 
    'points': [1.5, 1.7, 3.6, 2.4, 2.9]
} 
df = pd.DataFrame(data) 
df

   name  year  points
0  Choi  2013     1.5
1  Choi  2014     1.7
2  Choi  2015     3.6
3   Kim  2016     2.4
4  Park  2017     2.9

In [44]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [45]:
df.columns

Index(['name', 'year', 'points'], dtype='object')

In [46]:
df.values

array([['Choi', 2013, 1.5],
       ['Choi', 2014, 1.7],
       ['Choi', 2015, 3.6],
       ['Kim', 2016, 2.4],
       ['Park', 2017, 2.9]], dtype=object)

## 3.3 데이터프레임 열 갱신 추가

In [47]:
df = pd.DataFrame(data, columns=["year", "name", "points", "penalty"],
                         index=(["one", "two", "three", "four", "five"]))

# penalty 항목이 기존에 없었어서 NaN으로 채워짐
# NaN == NULL
df

       year  name  points penalty
one    2013  Choi     1.5     NaN
two    2014  Choi     1.7     NaN
three  2015  Choi     3.6     NaN
four   2016   Kim     2.4     NaN
five   2017  Park     2.9     NaN

In [48]:
df_year = df[["year","points"]] 
df_year

       year  points
one    2013     1.5
two    2014     1.7
three  2015     3.6
four   2016     2.4
five   2017     2.9

In [49]:
df["penalty"] = 0.5 
df

       year  name  points  penalty
one    2013  Choi     1.5      0.5
two    2014  Choi     1.7      0.5
three  2015  Choi     3.6      0.5
four   2016   Kim     2.4      0.5
five   2017  Park     2.9      0.5

In [50]:
df['penalty'] = [0.1, 0.2, 0.3, 0.4, 0.5] 
df

       year  name  points  penalty
one    2013  Choi     1.5      0.1
two    2014  Choi     1.7      0.2
three  2015  Choi     3.6      0.3
four   2016   Kim     2.4      0.4
five   2017  Park     2.9      0.5

In [51]:
import numpy as np

df['zeros'] = np.arange(5) 
df

       year  name  points  penalty  zeros
one    2013  Choi     1.5      0.1      0
two    2014  Choi     1.7      0.2      1
three  2015  Choi     3.6      0.3      2
four   2016   Kim     2.4      0.4      3
five   2017  Park     2.9      0.5      4

In [52]:
# df에 새로운 열을 삽입 
# Series로 삽입 가능
val = pd.Series([-1.2, -1.5, -1.7], index=['two','four','five']) 

df['debt'] = val 
df

       year  name  points  penalty  zeros  debt
one    2013  Choi     1.5      0.1      0   NaN
two    2014  Choi     1.7      0.2      1  -1.2
three  2015  Choi     3.6      0.3      2   NaN
four   2016   Kim     2.4      0.4      3  -1.5
five   2017  Park     2.9      0.5      4  -1.7

In [53]:
# 엑셀어서 처리하듯이 덧, 뺄셈 가능
df["net_points"] = df["points"] - df["penalty"]
df

       year  name  points  penalty  zeros  debt  net_points
one    2013  Choi     1.5      0.1      0   NaN         1.4
two    2014  Choi     1.7      0.2      1  -1.2         1.5
three  2015  Choi     3.6      0.3      2   NaN         3.3
four   2016   Kim     2.4      0.4      3  -1.5         2.0
five   2017  Park     2.9      0.5      4  -1.7         2.4

In [54]:
# 조건식을 통해서 새로운 행 삽입 가능
df["high_points"] = df["net_points"] > 2.0 
df

       year  name  points  penalty  zeros  debt  net_points  high_points
one    2013  Choi     1.5      0.1      0   NaN         1.4        False
two    2014  Choi     1.7      0.2      1  -1.2         1.5        False
three  2015  Choi     3.6      0.3      2   NaN         3.3         True
four   2016   Kim     2.4      0.4      3  -1.5         2.0        False
five   2017  Park     2.9      0.5      4  -1.7         2.4         True

In [56]:
# df에 "net_points" 값이 2.0보다 큰 df 값을 불러오기
df[df["net_points"] > 2.0]

       year  name  points  penalty  zeros  debt  net_points  high_points
three  2015  Choi     3.6      0.3      2   NaN         3.3         True
five   2017  Park     2.9      0.5      4  -1.7         2.4         True

In [57]:
# 전치(transtopse) : 행렬 연산시 제일 많이 씀
#     2x3과 3x2는 dot(행렬식 곱하기) 연산이 가능하지만
#     2x3이랑 2x3은 dot 연산이 안 되서 이런거 연산할때 사용함
df.T

               one    two three   four  five
year          2013   2014  2015   2016  2017
name          Choi   Choi  Choi    Kim  Park
points         1.5    1.7   3.6    2.4   2.9
penalty        0.1    0.2   0.3    0.4   0.5
zeros            0      1     2      3     4
debt           NaN   -1.2   NaN   -1.5  -1.7
net_points     1.4    1.5   3.3    2.0   2.4
high_points  False  False  True  False  True

In [58]:
# Series 삭제
del df["high_points"] 
del df["net_points"] 
del df["zeros"] 
df

       year  name  points  penalty  debt
one    2013  Choi     1.5      0.1   NaN
two    2014  Choi     1.7      0.2  -1.2
three  2015  Choi     3.6      0.3   NaN
four   2016   Kim     2.4      0.4  -1.5
five   2017  Park     2.9      0.5  -1.7

In [59]:
df.columns

Index(['year', 'name', 'points', 'penalty', 'debt'], dtype='object')

In [ ]:
df.index.name = "Order" 
df.columns.name = "Info" 
df

## 3.4 데이터프레임 인덱싱

In [60]:
df[["year","points"]]

       year  points
one    2013     1.5
two    2014     1.7
three  2015     3.6
four   2016     2.4
five   2017     2.9

In [61]:
# dataFrame으로서 "year" 행을 가져오기
df[["year"]]

       year
one    2013
two    2014
three  2015
four   2016
five   2017

In [67]:
# Series로 "year" 행을 가져오기
print(type(df["year"]))
print(df["year"])

<class 'pandas.core.series.Series'>
one      2013
two      2014
three    2015
four     2016
five     2017
Name: year, dtype: int64

In [68]:
print(type(df.year))
print(df.year)

<class 'pandas.core.series.Series'>
one      2013
two      2014
three    2015
four     2016
five     2017
Name: year, dtype: int64

In [64]:
df2 = pd.DataFrame(np.arange(12).reshape(3, 4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [69]:
df2[2]

0     2
1     6
2    10
Name: 2, dtype: int32

In [70]:
df[0:1]

     year  name  points  penalty  debt
one  2013  Choi     1.5      0.1   NaN

In [71]:
df[0:3]

       year  name  points  penalty  debt
one    2013  Choi     1.5      0.1   NaN
two    2014  Choi     1.7      0.2  -1.2
three  2015  Choi     3.6      0.3   NaN

In [72]:
df['year']['one']

2013

## <font color=blue> 연습 문제 1 </font>   
- 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.
- 3가지 이상의 방법으로 특정한 행과 열을 선택한다.

In [113]:
# 1. 데이터 프레임 생성

data = np.arange(1, 26).reshape(5, -1)

test1_df =  pd.DataFrame(data, columns=["hi", "i", "am", "groot", "!"],
                         index=(["a", "b", "c", "d", "e"]))

test1_df

   hi   i  am  groot   !
a   1   2   3      4   5
b   6   7   8      9  10
c  11  12  13     14  15
d  16  17  18     19  20
e  21  22  23     24  25

In [117]:
# 2. 특정 행과 열 선택 (1) - 특정 행 선택
test1_df[2:3]
test1_df.loc["e", :]

hi       21
i        22
am       23
groot    24
!        25
Name: e, dtype: int32

In [118]:
# 2. 특정 행과 열 선택 (2) - 특정 열 선택
test1_df[['groot']]

   groot
a      4
b      9
c     14
d     19
e     24

In [119]:
# 2. 특정 행과 열 선택 (3) - 일부 행 선택
test1_df[test1_df["groot"] > 15.0]

   hi   i  am  groot   !
d  16  17  18     19  20
e  21  22  23     24  25

In [129]:
# 2. 특정 행과 열 선택 (4) - 일부 열 선택
test1_df.loc[:, ["!"]]

    !
a   5
b  10
c  15
d  20
e  25

In [130]:
# 2. 특정 행과 열 선택 (5) - 리스트 이용 행 선택

test1_df[test1_df["groot"] > 15.0]

   hi   i  am  groot   !
d  16  17  18     19  20
e  21  22  23     24  25

In [131]:
# 2. 특정 행과 열 선택 (6) - 리스트 이용 열 선택

test1_df.loc[:, ["i", "groot"]]

    i  groot
a   2      4
b   7      9
c  12     14
d  17     19
e  22     24

## 3.5 데이터프레임 고급 인덱싱

numpy 행렬과 같이 쉼표를 사용한 (행인덱스, 열 인덱스) 형식의 2차원인덱싱 지원

### 3.5.1 loc 인덱싱

인덱스의 라벨값 기반의 2차원 (행, 열)인덱싱
- 사용법 : df.loc[행 인덱스 값] 또는 df.loc[행 인덱스값, 열 인덱스값]

In [94]:
df

       year  name  points  penalty  debt
one    2013  Choi     1.5      0.1   NaN
two    2014  Choi     1.7      0.2  -1.2
three  2015  Choi     3.6      0.3   NaN
four   2016   Kim     2.4      0.4  -1.5
five   2017  Park     2.9      0.5  -1.7

In [95]:
df.loc["two"]

year       2014
name       Choi
points      1.7
penalty     0.2
debt       -1.2
Name: two, dtype: object

In [96]:
df.loc["two":"four"]

       year  name  points  penalty  debt
two    2014  Choi     1.7      0.2  -1.2
three  2015  Choi     3.6      0.3   NaN
four   2016   Kim     2.4      0.4  -1.5

In [99]:
df.loc["two":"four", "points"]

two      1.7
three    3.6
four     2.4
Name: points, dtype: float64

In [100]:
df.loc[:,'year']

one      2013
two      2014
three    2015
four     2016
five     2017
Name: year, dtype: int64

In [101]:
df.loc["three":"five","year":"penalty"]

       year  name  points  penalty
three  2015  Choi     3.6      0.3
four   2016   Kim     2.4      0.4
five   2017  Park     2.9      0.5

In [ ]:
df.loc[df.year > 2015]

In [102]:
df.loc['six',:] = [2013,'Jun',4.0,0.1,2.1] 
df

         year  name  points  penalty  debt
one    2013.0  Choi     1.5      0.1   NaN
two    2014.0  Choi     1.7      0.2  -1.2
three  2015.0  Choi     3.6      0.3   NaN
four   2016.0   Kim     2.4      0.4  -1.5
five   2017.0  Park     2.9      0.5  -1.7
six    2013.0   Jun     4.0      0.1   2.1

### 3.5.2 iloc 인덱싱

index 번호로 인덱싱하는 거<br>
loc 인덱서와 반대로 라벨이 아닌 순서를 나타내는 정수 인덱스 만 받음

In [103]:
df.iloc[3]

year       2016.0
name          Kim
points        2.4
penalty       0.4
debt         -1.5
Name: four, dtype: object

In [104]:
df.iloc[3:5, 0:2]

        year  name
four  2016.0   Kim
five  2017.0  Park

In [105]:
df.iloc[[0,1,3], [1,2]]

      name  points
one   Choi     1.5
two   Choi     1.7
four   Kim     2.4

In [106]:
df.iloc[:,1:4]

       name  points  penalty
one    Choi     1.5      0.1
two    Choi     1.7      0.2
three  Choi     3.6      0.3
four    Kim     2.4      0.4
five   Park     2.9      0.5
six     Jun     4.0      0.1

In [107]:
df.iloc[1,1]

'Choi'

## 3.6 Boolean 인덱싱

In [127]:
df.loc[df['name'] == "Choi", ['name','points']]

       name  points
one    Choi     1.5
two    Choi     1.7
three  Choi     3.6

In [128]:
df.loc[(df["points"] > 2) & (df["points"]<3), :]

        year  name  points  penalty  debt
four  2016.0   Kim     2.4      0.4  -1.5
five  2017.0  Park     2.9      0.5  -1.7

In [133]:
con1 = df["points"] > 2
con2 = df["points"] < 3

df.loc[con1 & con2, :]

        year  name  points  penalty  debt
four  2016.0   Kim     2.4      0.4  -1.5
five  2017.0  Park     2.9      0.5  -1.7

## 4. 데이터프레임 다루기

### 4.1 numpy로 데이터프레임 결측치 다루기

비어있는 NaN 값을 결측치라고 표현

In [134]:
df = pd.DataFrame(np.random.randn(6,4))  # random.randn 가우시안 표준정규분포에서 난수 발생
df

          0         1         2         3
0  2.239453 -0.871323 -0.954716 -0.406364
1  0.262064  1.486745 -1.767891 -1.216921
2  0.329630 -0.204042  0.910319  1.090652
3  0.893857  0.302491  1.291897  2.060431
4  0.211789 -0.141610 -0.851326  0.654361
5  1.403178 -0.386357 -2.795387 -1.220974

In [135]:
# 컬럼명 지정하기
df.columns = ["A", "B", "C", "D"] 
df

          A         B         C         D
0  2.239453 -0.871323 -0.954716 -0.406364
1  0.262064  1.486745 -1.767891 -1.216921
2  0.329630 -0.204042  0.910319  1.090652
3  0.893857  0.302491  1.291897  2.060431
4  0.211789 -0.141610 -0.851326  0.654361
5  1.403178 -0.386357 -2.795387 -1.220974

In [136]:
# np.nan은 NaN값을 의미
# 기계학습에서는 NaN은 학습이 안됨

df["F"] = [1.0, np.nan, 3.5, 6.1, np.nan, 7.0] 
df

          A         B         C         D    F
0  2.239453 -0.871323 -0.954716 -0.406364  1.0
1  0.262064  1.486745 -1.767891 -1.216921  NaN
2  0.329630 -0.204042  0.910319  1.090652  3.5
3  0.893857  0.302491  1.291897  2.060431  6.1
4  0.211789 -0.141610 -0.851326  0.654361  NaN
5  1.403178 -0.386357 -2.795387 -1.220974  7.0

### 4.2 drop 명령어

In [138]:
# 행의 값의 모든 값이 nan인 경우 그 행을 없앤다.

# dropna : 값이 NaN인 경우 삭제
#          how='all' : 전부 NaN인 경우 삭제
#             ='any' : 하나라도 NaN인 경우 삭제
#          axis=0 : 행 삭제 (default)
#              =1 : 열 삭제

# 데이터가 굉장히 많은데 NaN이 있는 경우 

df0 = df.dropna(how='all')
df0

          A         B         C         D    F
0  2.239453 -0.871323 -0.954716 -0.406364  1.0
1  0.262064  1.486745 -1.767891 -1.216921  NaN
2  0.329630 -0.204042  0.910319  1.090652  3.5
3  0.893857  0.302491  1.291897  2.060431  6.1
4  0.211789 -0.141610 -0.851326  0.654361  NaN
5  1.403178 -0.386357 -2.795387 -1.220974  7.0

In [139]:
# 행의 값중 하나라도 nan인 경우 그 행을 없앤다. 
df1= df.dropna(how="any") 
df1

          A         B         C         D    F
0  2.239453 -0.871323 -0.954716 -0.406364  1.0
2  0.329630 -0.204042  0.910319  1.090652  3.5
3  0.893857  0.302491  1.291897  2.060431  6.1
5  1.403178 -0.386357 -2.795387 -1.220974  7.0

In [140]:
df

          A         B         C         D    F
0  2.239453 -0.871323 -0.954716 -0.406364  1.0
1  0.262064  1.486745 -1.767891 -1.216921  NaN
2  0.329630 -0.204042  0.910319  1.090652  3.5
3  0.893857  0.302491  1.291897  2.060431  6.1
4  0.211789 -0.141610 -0.851326  0.654361  NaN
5  1.403178 -0.386357 -2.795387 -1.220974  7.0

In [141]:
# NaN에 특정 value 값 넣기

# fillna : 값이 NaN인 경우 대체
#          value= : NaN 값을 대체할 

# 보통 평균값을 많이 채워 넣음 
#    (가우시안 분포와 같은 형태일때)
# 최대나 최소가 너무 크거나 작을때 
#    최빈값이나 분포를 보고 채움

df.fillna(value=0.5)

          A         B         C         D    F
0  2.239453 -0.871323 -0.954716 -0.406364  1.0
1  0.262064  1.486745 -1.767891 -1.216921  0.5
2  0.329630 -0.204042  0.910319  1.090652  3.5
3  0.893857  0.302491  1.291897  2.060431  6.1
4  0.211789 -0.141610 -0.851326  0.654361  0.5
5  1.403178 -0.386357 -2.795387 -1.220974  7.0

In [142]:
# 특정 열 삭제하기 
df.drop('F', axis = 1)

          A         B         C         D
0  2.239453 -0.871323 -0.954716 -0.406364
1  0.262064  1.486745 -1.767891 -1.216921
2  0.329630 -0.204042  0.910319  1.090652
3  0.893857  0.302491  1.291897  2.060431
4  0.211789 -0.141610 -0.851326  0.654361
5  1.403178 -0.386357 -2.795387 -1.220974

## <font color=blue> 연습 문제 2 </font>

다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

```
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
```

(1) 모든 학생의 수학 점수를 시리즈로 나타낸다.

(2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.

(3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

(4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

(5) 춘향의 점수를 데이터프레임으로 나타낸다.

(6) 향단의 점수를 시리즈로 나타낸다.

In [244]:
import pandas as pd
# 데이터 생성
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]

df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [245]:
# (1) 수학 점수 시리즈
math_s = df["수학"]
# math_s = df.loc[:, "수학"]

print(type(math_s))
print(math_s)

<class 'pandas.core.series.Series'>
춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [246]:
# (2) 모든 학생의 국어와 영어 점수 데이터 프레임
korEng_df = df[["국어", "영어"]]
#korEng_df = df.loc[:, "국어": "영어"]
korEng_df

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [247]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가
df["평균"]= df.mean(axis=1)

avg = (df["국어"] + df["국어"] + df["국어"]) / 3
df["평균"] = avg.round(1)

df["평균2"]= df.loc[:,"국어":"수학"].mean(axis=1).round(1)

df

    국어  영어  수학    평균   평균2
춘향  80  90  90  80.0  86.7
몽룡  90  70  60  90.0  73.3
향단  70  60  80  70.0  70.0
방자  30  40  70  30.0  46.7

In [248]:
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산
df["영어"]["방자"] = 80

avg = (df["국어"] + df["국어"] + df["국어"]) / 3
df["평균"] = avg.round(1)

df["평균2"]= df.loc[:,"국어":"수학"].mean(axis=1).round(1)

df

C:\Users\IOT\AppData\Local\Temp\ipykernel_15152\2122807743.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["영어"]["방자"] = 80

    국어  영어  수학    평균   평균2
춘향  80  90  90  80.0  86.7
몽룡  90  70  60  90.0  73.3
향단  70  60  80  70.0  70.0
방자  30  80  70  30.0  60.0

In [249]:
# (5) 춘향의 점수를 데이터프레임 형태로
df.loc[["춘향"]]
#df.loc["춘향"].to_frame()

    국어  영어  수학    평균   평균2
춘향  80  90  90  80.0  86.7

In [253]:
# (6) 향단의 점수를 시리즈 형태로
print(type(df.loc["향단"]))
print(df.loc["향단"])
print("\n")
print(df.iloc[2])

<class 'pandas.core.series.Series'>
국어     70.0
영어     60.0
수학     80.0
평균     70.0
평균2    70.0
Name: 향단, dtype: float64


국어     70.0
영어     60.0
수학     80.0
평균     70.0
평균2    70.0
Name: 향단, dtype: float64

df2[2]   > 인덱싱   : columns 기준<br>
df2[0:1] > 슬라이스 : row 기준

## 5. 데이터 입출력
- pandas는 데이터 분석을 위해 여러 포맷의 데이터 파일을 읽고 쓸수 있다.
- csv, excel, html, json, hdf5, sas, stata, sql
<br>
- csv : 데이터값이 쉼표(comma)로 구분된 텍스트 파일

In [254]:
import pandas as pd

### 5.1 pandas 데이터 파일 불러오기

### 불러올 파일을 임시로 생성

In [255]:
%%writefile sample.csv
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample.csv

In [256]:
%ls

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: 483A-ADF8

 C:\Users\IOT\Documents\vision_AI\0423 디렉터리

2024-04-23  오후 02:09    <DIR>          .
2024-04-23  오전 09:18    <DIR>          ..
2024-04-23  오전 10:53    <DIR>          .ipynb_checkpoints
2024-04-23  오전 10:43            58,314 1_Numpy.ipynb
2024-04-23  오후 02:09           145,256 2_Pandas.ipynb
2024-04-23  오전 09:21           260,259 3_Matplotlib.ipynb
2024-04-23  오전 09:21            12,623 4_Data import and processing.ipynb
2024-04-23  오전 09:21           140,122 5_Basic data processing and visualization.ipynb
2024-04-23  오전 09:21             1,207 magic.py
2024-04-23  오전 09:22    <DIR>          resources
2024-04-23  오후 02:09                44 sample.csv
               7개 파일             617,825 바이트
               4개 디렉터리  127,787,995,136 바이트 남음

## 읽어오기 전에 파일의 생김새를 확인하기

column의 이름이 파일에 있는 지 없는지, <br>
상단의 설명 등에 따라 조정해서 읽어옴

In [261]:
# csv 파일로부터 데이터 읽어 데이터프레임 만들기: pandas.read_csv()
# sample1.csv 파일은 열 인덱스(c1, c2, c3)는 있으나 행 인덱스 없음. 정수인덱스 자동추가됨
pd.read_csv('sample.csv')

   1   1.11     one
0  2   2.22     two
1  3   3.33   three

In [262]:
pd.read_csv('sample.csv', names=['c1', 'c2', 'c3'])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [263]:
%%writefile sample1.csv
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting sample1.csv

In [264]:
pd.read_csv('sample1.csv')

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [267]:
# index_col > 지정한 column을 index로 지정
pd.read_csv('sample1.csv', index_col='c1')

      c2      c3
c1
1   1.11     one
2   2.22     two
3   3.33   three

### 5.2 pandas 데이터 파일 저장하기

In [ ]:
df = pd.read_csv('sample1.csv', index_col='c1')

In [268]:
df.to_csv('sample2.csv', sep=',', index=False, header=False)

In [269]:
%ls

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: 483A-ADF8

 C:\Users\IOT\Documents\vision_AI\0423 디렉터리

2024-04-23  오후 02:17    <DIR>          .
2024-04-23  오전 09:18    <DIR>          ..
2024-04-23  오전 10:53    <DIR>          .ipynb_checkpoints
2024-04-23  오전 10:43            58,314 1_Numpy.ipynb
2024-04-23  오후 02:17           153,218 2_Pandas.ipynb
2024-04-23  오전 09:21           260,259 3_Matplotlib.ipynb
2024-04-23  오전 09:21            12,623 4_Data import and processing.ipynb
2024-04-23  오전 09:21           140,122 5_Basic data processing and visualization.ipynb
2024-04-23  오전 09:21             1,207 magic.py
2024-04-23  오전 09:22    <DIR>          resources
2024-04-23  오후 02:09                44 sample.csv
2024-04-23  오후 02:16                56 sample1.csv
2024-04-23  오후 02:17                80 sample2.csv
               9개 파일             625,923 바이트
               4개 디렉터리  127,806,726,144 바이트 남음

In [270]:
# 파일 내용 보려면 type()함수를 사용
!type sample2.csv

80,90,90,80.0,86.7
90,70,60,90.0,73.3
70,60,80,70.0,70.0
30,80,70,30.0,60.0